{"id":"newman-griffis-2022","title":"Definition drives design: Disability models and mechanisms of bias in AI technologies","authors":"Denis Newman-Griffis, Jessica Sage Rauchberg, Rahaf Alharbi, Louise Hickman, Harry Hochheiser","journal":"arXiv","year":"2022","doi":"arXiv:2206.08287","url":"https://arxiv.org/abs/2206.08287","keyAssumptions":"AI bias emerges from algorithms; disability categories are objectively definable; technical solutions alone address bias","keyHypotheses":"Bias emerges from fundamental design decisions about disability conceptualization; different disability models create different AI architectures","strengths":"Novel framework linking disability models to AI design; comprehensive analysis of bias mechanisms","weaknesses":"Limited empirical validation; primarily theoretical analysis","citation":"Newman-Griffis, D., Rauchberg, J.S., Alharbi, R., Hickman, L., & Hochheiser, H. (2022). Definition drives design: Disability models and mechanisms of bias in AI technologies. arXiv:2206.08287","notes":"Direct support for Assumption 4 - disability categories are dynamically constructed","addedDate":"2025-08-14T02:57:00.000Z"}
{"id":"macpherson-2019","title":"Ethical Challenges of Germline Genetic Enhancement","authors":"Ignacio Macpherson, María Victoria Roqué, Ignacio Segarra","journal":"Frontiers in Genetics","year":"2019","doi":"10.3389/fgene.2019.00767","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC6733984/","keyAssumptions":"Individual autonomy sufficient for genetic decisions; genetic modifications have predictable intergenerational effects","keyHypotheses":"Germline modifications require new ethical frameworks beyond individual consent due to intergenerational impacts","strengths":"Comprehensive ethical analysis; focuses on intergenerational impacts","weaknesses":"Limited empirical validation of proposed frameworks","citation":"Macpherson, I., Roqué, M.V., & Segarra, I. (2019). Ethical Challenges of Germline Genetic Enhancement. Frontiers in Genetics, 10, 767","notes":"Direct support for Assumption 2 - individual autonomy insufficient for genetic selection decisions","addedDate":"2025-08-14T02:57:01.000Z"}
{"id":"veit-2018","title":"Procreative Beneficence and Genetic Enhancement","authors":"Walter Veit","journal":"Kriterion - Journal of Philosophy","year":"2018","doi":"10.1515/krt-2018-0004","url":"https://philarchive.org/rec/VEIPBA","keyAssumptions":"Best possible life can be objectively determined; individual parental choice primary framework","keyHypotheses":"Accepting procreative beneficence commits parents to genetic enhancement obligations","strengths":"Clear logical argumentation; connects embryo selection to genetic modification","weaknesses":"Purely philosophical analysis; no empirical testing of assumptions","citation":"Veit, W. (2018). Procreative Beneficence and Genetic Enhancement. Kriterion - Journal of Philosophy, 32(1), 75-92","notes":"Challenges Assumption 1 - questions objective determination of benefit/harm","addedDate":"2025-08-14T02:57:02.000Z"}
{"id":"tubig-2023","title":"Is a deaf future an Open future? Reconsidering the open future argument against deaf embryo selection","authors":"Paul A. Tubig","journal":"Monash Bioethics Review","year":"2023","doi":"10.1007/s40592-023-00175-x","url":"https://link.springer.com/article/10.1007/s40592-023-00175-x","keyAssumptions":"Deafness inherently limits opportunities; open future can be objectively defined; autonomy is individual","keyHypotheses":"Open future arguments fail due to unjustified negative presumptions about deaf embodiments; autonomy has social/relational components","strengths":"Challenges ableist assumptions; considers social construction of disability","weaknesses":"Limited empirical testing of autonomy outcomes","citation":"Tubig, P.A. (2023). Is a deaf future an 'Open' future? Reconsidering the open future argument against deaf embryo selection. Monash Bioethics Review, 41, 175-195","notes":"Strong support for Assumption 4 - disability categories socially constructed rather than fixed medical conditions","addedDate":"2025-08-14T02:57:03.000Z"}
{"id":"mikkelsen-2019","title":"Genetic Protection Modifications: Moving Beyond the Binary Distinction Between Therapy and Enhancement for Human Genome Editing","authors":"Rasmus Bjerregaard Mikkelsen, Henriette Reventlow S. Frederiksen, Mickey Gjerris, Björn Holst, Poul Hyttel, Yonglun Luo, Kristine Freude, Peter Sandøe","journal":"CRISPR Journal","year":"2019","doi":"10.1089/crispr.2019.0011","url":"https://philarchive.org/rec/MIKGPM","keyAssumptions":"Genetic interventions fit therapy/enhancement binary; ethical evaluation depends on categorization","keyHypotheses":"Genetic protection modifications constitute third category for disease prevention interventions","strengths":"Challenges binary thinking; provides specific medical examples","weaknesses":"Limited empirical testing; no policy implementation validation","citation":"Mikkelsen, R.B., Frederiksen, H.R.S., Gjerris, M., Holst, B., Hyttel, P., Luo, Y., Freude, K., & Sandøe, P. (2019). Genetic Protection Modifications: Moving Beyond the Binary Distinction Between Therapy and Enhancement for Human Genome Editing. CRISPR Journal, 2(6), 362-369","notes":"Supports Assumption 1 challenge - genetic interventions exist on spectrums beyond traditional categories","addedDate":"2025-08-14T02:57:04.000Z"}